grevaillot/svd_tools/headers/ATSAMV71N20/usart2.h
#define USART2_US_RHR_RXCHR_SHIFT		0
#define USART2_US_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart2_us_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_thr USTHR Transmit Holding Register
@{*/

/** USART2_US_THR_TXSYNH Sync Field to be Transmitted **/
#define USART2_US_THR_TXSYNH		(1 << 15)

#define USART2_US_THR_TXCHR_SHIFT		0
#define USART2_US_THR_TXCHR_MASK		0x1ff
/** @defgroup usart2_us_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_brgr USBRGR Baud Rate Generator Register
@{*/


#define USART2_US_BRGR_FP_SHIFT		16
#define USART2_US_BRGR_FP_MASK		0x07
/** @defgroup usart2_us_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART2_US_BRGR_CD_SHIFT		0
#define USART2_US_BRGR_CD_MASK		0xffff
/** @defgroup usart2_us_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_rtor USRTOR Receiver Timeout Register
@{*/


#define USART2_US_RTOR_TO_SHIFT		0
#define USART2_US_RTOR_TO_MASK		0x1ffff
/** @defgroup usart2_us_rtor_to TO Timeout Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_ttgr USTTGR Transmitter Timeguard Register
@{*/


#define USART2_US_TTGR_TG_SHIFT		0
#define USART2_US_TTGR_TG_MASK		0xff
/** @defgroup usart2_us_ttgr_tg TG Timeguard Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_fidi USFIDI FI DI Ratio Register
@{*/


#define USART2_US_FIDI_FI_DI_RATIO_SHIFT		0
#define USART2_US_FIDI_FI_DI_RATIO_MASK		0xffff
/** @defgroup usart2_us_fidi_fi_di_ratio FIDIRATIO FI Over DI Ratio Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_ner USNER Number of Errors Register
@{*/


#define USART2_US_NER_NB_ERRORS_SHIFT		0
#define USART2_US_NER_NB_ERRORS_MASK		0xff
/** @defgroup usart2_us_ner_nb_errors NBERRORS Number of Errors
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_if USIF IrDA Filter Register
@{*/


#define USART2_US_IF_IRDA_FILTER_SHIFT		0
#define USART2_US_IF_IRDA_FILTER_MASK		0xff
/** @defgroup usart2_us_if_irda_filter IRDAFILTER IrDA Filter
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_man USMAN Manchester Configuration Register
@{*/

/** USART2_US_MAN_RXIDLEV  **/
#define USART2_US_MAN_RXIDLEV		(1 << 31)
/** USART2_US_MAN_DRIFT Drift Compensation **/
#define USART2_US_MAN_DRIFT		(1 << 30)
/** USART2_US_MAN_ONE Must Be Set to 1 **/
#define USART2_US_MAN_ONE		(1 << 29)
/** USART2_US_MAN_RX_MPOL Receiver Manchester Polarity **/
#define USART2_US_MAN_RX_MPOL		(1 << 28)

#define USART2_US_MAN_RX_PP_SHIFT		24
#define USART2_US_MAN_RX_PP_MASK		0x03
/** @defgroup usart2_us_man_rx_pp RXPP Receiver Preamble Pattern detected
@{*/
/**@}*/


#define USART2_US_MAN_RX_PL_SHIFT		16
#define USART2_US_MAN_RX_PL_MASK		0x0f
/** @defgroup usart2_us_man_rx_pl RXPL Receiver Preamble Length
@{*/
/**@}*/

/** USART2_US_MAN_TX_MPOL Transmitter Manchester Polarity **/
#define USART2_US_MAN_TX_MPOL		(1 << 12)

#define USART2_US_MAN_TX_PP_SHIFT		8
#define USART2_US_MAN_TX_PP_MASK		0x03
/** @defgroup usart2_us_man_tx_pp TXPP Transmitter Preamble Pattern
@{*/
/**@}*/


#define USART2_US_MAN_TX_PL_SHIFT		0
#define USART2_US_MAN_TX_PL_MASK		0x0f
/** @defgroup usart2_us_man_tx_pl TXPL Transmitter Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linmr USLINMR LIN Mode Register
@{*/

/** USART2_US_LINMR_SYNCDIS Synchronization Disable **/
#define USART2_US_LINMR_SYNCDIS		(1 << 17)
/** USART2_US_LINMR_PDCM DMAC Mode **/
#define USART2_US_LINMR_PDCM		(1 << 16)

#define USART2_US_LINMR_DLC_SHIFT		8
#define USART2_US_LINMR_DLC_MASK		0xff
/** @defgroup usart2_us_linmr_dlc DLC Data Length Control
@{*/
/**@}*/

/** USART2_US_LINMR_WKUPTYP Wakeup Signal Type **/
#define USART2_US_LINMR_WKUPTYP		(1 << 7)
/** USART2_US_LINMR_FSDIS Frame Slot Mode Disable **/
#define USART2_US_LINMR_FSDIS		(1 << 6)
/** USART2_US_LINMR_DLM Data Length Mode **/
#define USART2_US_LINMR_DLM		(1 << 5)
/** USART2_US_LINMR_CHKTYP Checksum Type **/
#define USART2_US_LINMR_CHKTYP		(1 << 4)
/** USART2_US_LINMR_CHKDIS Checksum Disable **/
#define USART2_US_LINMR_CHKDIS		(1 << 3)
/** USART2_US_LINMR_PARDIS Parity Disable **/
#define USART2_US_LINMR_PARDIS		(1 << 2)

#define USART2_US_LINMR_NACT_SHIFT		0
#define USART2_US_LINMR_NACT_MASK		0x03
/** @defgroup usart2_us_linmr_nact NACT LIN Node Action
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linir USLINIR LIN Identifier Register
@{*/


#define USART2_US_LINIR_IDCHR_SHIFT		0
#define USART2_US_LINIR_IDCHR_MASK		0xff
/** @defgroup usart2_us_linir_idchr IDCHR Identifier Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_linbrr USLINBRR LIN Baud Rate Register
@{*/


#define USART2_US_LINBRR_LINFP_SHIFT		16
#define USART2_US_LINBRR_LINFP_MASK		0x07
/** @defgroup usart2_us_linbrr_linfp LINFP Fractional Part after Synchronization
@{*/
/**@}*/


#define USART2_US_LINBRR_LINCD_SHIFT		0
#define USART2_US_LINBRR_LINCD_MASK		0xffff
/** @defgroup usart2_us_linbrr_lincd LINCD Clock Divider after Synchronization
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonmr USLONMR LON Mode Register
@{*/


#define USART2_US_LONMR_EOFS_SHIFT		16
#define USART2_US_LONMR_EOFS_MASK		0xff
/** @defgroup usart2_us_lonmr_eofs EOFS End of Frame Condition Size
@{*/
/**@}*/

/** USART2_US_LONMR_LCDS LON Collision Detection Source **/
#define USART2_US_LONMR_LCDS		(1 << 5)
/** USART2_US_LONMR_DMAM LON DMA Mode **/
#define USART2_US_LONMR_DMAM		(1 << 4)
/** USART2_US_LONMR_CDTAIL LON Collision Detection on Frame Tail **/
#define USART2_US_LONMR_CDTAIL		(1 << 3)
/** USART2_US_LONMR_TCOL Terminate Frame upon Collision Notification **/
#define USART2_US_LONMR_TCOL		(1 << 2)
/** USART2_US_LONMR_COLDET LON Collision Detection Feature **/
#define USART2_US_LONMR_COLDET		(1 << 1)
/** USART2_US_LONMR_COMMT LON comm_type Parameter Value **/
#define USART2_US_LONMR_COMMT		(1 << 0)

/**@}*/

/** @defgroup usart2_us_lonpr USLONPR LON Preamble Register
@{*/


#define USART2_US_LONPR_LONPL_SHIFT		0
#define USART2_US_LONPR_LONPL_MASK		0x3fff
/** @defgroup usart2_us_lonpr_lonpl LONPL LON Preamble Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_londl USLONDL LON Data Length Register
@{*/


#define USART2_US_LONDL_LONDL_SHIFT		0
#define USART2_US_LONDL_LONDL_MASK		0xff
/** @defgroup usart2_us_londl_londl LONDL LON Data Length
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonl2hdr USLONL2HDR LON L2HDR Register
@{*/

/** USART2_US_LONL2HDR_PB LON Priority Bit **/
#define USART2_US_LONL2HDR_PB		(1 << 7)
/** USART2_US_LONL2HDR_ALTP LON Alternate Path Bit **/
#define USART2_US_LONL2HDR_ALTP		(1 << 6)

#define USART2_US_LONL2HDR_BLI_SHIFT		0
#define USART2_US_LONL2HDR_BLI_MASK		0x3f
/** @defgroup usart2_us_lonl2hdr_bli BLI LON Backlog Increment
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonbl USLONBL LON Backlog Register
@{*/


#define USART2_US_LONBL_LONBL_SHIFT		0
#define USART2_US_LONBL_LONBL_MASK		0x3f
/** @defgroup usart2_us_lonbl_lonbl LONBL LON Node Backlog Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart2_us_lonb1tx USLONB1TX LON Beta1 Tx Register
@{*/


#define USART2_US_LONB1TX_BETA1TX_SHIFT		0
#define USART2_US_LONB1TX_BETA1TX_MASK		0xffffff
/** @defgroup usart2_us_lonb1tx_beta1tx BETA1TX LON Beta1 Length after Transmission
@{*/
/**@}*/


/**@}*/

